---
type: AlignmentStationLabelSetOptions
namespace: Autodesk.Revit.DB.Infrastructure
version: 2024
members: 7
tags: [revit-api, class]
---

# AlignmentStationLabelSetOptions

`Autodesk.Revit.DB.Infrastructure.AlignmentStationLabelSetOptions` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | AlignmentStationLabelSetOptions | 2021.1 | `public AlignmentStationLabelSetOptions ()` |
| Property | EndStation | 2021.1 | `public Nullable < double > EndStation { get ; set ; }` |
| Property | HasLeader | 2021.1 | `public bool HasLeader { get ; set ; }` |
| Property | Interval | 2021.1 | `public Nullable < double > Interval { get ; set ; }` |
| Property | Offset | 2021.1 | `public Nullable < double > Offset { get ; set ; }` |
| Property | StartStation | 2021.1 | `public Nullable < double > StartStation { get ; set ; }` |
| Property | TypeId | 2021.1 | `public ElementId TypeId { get ; set ; }` |